app/views/restaurants/_cuisinetemplate.html.erb

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ? AND "ratings"."cuisine_id" = ?  ORDER BY "ratings"."id" ASC LIMIT 1  [["user_id", 2], ["cuisine_id", 2]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ?  ORDER BY "restaurants"."id" ASC LIMIT 1  [["id", 0]]
---
		<p>
			<%= link_to raw(Restaurant.where(id: restaurant).first.rating_icon(current_user.id, @cuisine, 1)), url_for(controller: "ratings", action: "add_rating", which: 1, cuisine_id: cuisine), id: cuisine, method: :post %>

SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ?  ORDER BY "cuisines"."id" ASC LIMIT 1  [["id", 2]]
---
			<header id="inside">
				<span><%= Cuisine.where(id: @cuisine).first.name %></span>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
						<div id="inner_upper">
							<span id="one_name"><%= "#{review.user.first_name} #{review.user.last_name}" %></span>

SELECT COUNT(*) FROM "been_heres" WHERE "been_heres"."user_id" = 2 AND "been_heres"."restaurant_id" = 1
---
								</span>
								<span><%= Like.where(user: review.user, review: review).count %>