app/views/restaurants/details.html.erb

SELECT "cuisines".* FROM "cuisines" WHERE "cuisines"."restaurant_id" = 1
---

					<% Cuisine.where(restaurant: @restaurant).each do |cuis| %>