app/controllers/been_heres_controller.rb

	def toggle_beenhere
		@restaurant = Restaurant.find(params[:restaurant])
		beenhere = BeenHere.where(user: current_user, restaurant: @restaurant).first
		@is_beenhere = false
		if beenhere
			beenhere.destroy!
			@is_beenhere = false
		else
			BeenHere.create(user: current_user, restaurant: @restaurant)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "been_heres".* FROM "been_heres" WHERE "been_heres"."user_id" = 2 AND "been_heres"."restaurant_id" = 1  ORDER BY "been_heres"."id" ASC LIMIT 1
DELETE FROM "been_heres" WHERE "been_heres"."id" = ?  [["id", 1]]
INSERT INTO "been_heres" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["restaurant_id", 1], ["created_at", "2017-07-23 07:15:43.934632"], ["updated_at", "2017-07-23 07:15:43.934632"]]