app/controllers/bookmarks_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 2 AND "bookmarks"."restaurant_id" = 1  ORDER BY "bookmarks"."id" ASC LIMIT 1
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
INSERT INTO "bookmarks" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["restaurant_id", 1], ["created_at", "2017-07-23 06:21:27.010877"], ["updated_at", "2017-07-23 06:21:27.010877"]]
---
	def toggle_bookmark
		@restaurant = Restaurant.find(params[:restaurant])
		bookmark = Bookmark.where(user: current_user, restaurant: @restaurant).first
		@is_bookmarked = false
		if bookmark
			bookmark.destroy!
			@is_bookmarked = false
		else
			Bookmark.create(user: current_user, restaurant: @restaurant)