app/controllers/home_controller.rb

	def upload_image
		byebug
	  	uploaded_file = params[:image]
	  	byebug
	  	filename = uploaded_file.original_filename
	  	# filename = SecureRandom.hex + "." +uploaded_file.original_filename.split('.')[1]
	  	filepath = Dir.pwd + "/public/uploads/" + filename
	  	File.open(filepath,'wb') do |file|
	  		file.write(uploaded_file.read())
	  	end

	  	current_user.profile_picture = filename
	  	current_user.save!
---
UPDATE "users" SET "profile_picture" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_picture", "62ecce586ecc8718dc3e6783c678a381.jpg"], ["updated_at", "2017-07-19 11:15:10.997212"], ["id", 1]]