app/controllers/restaurants_controller.rb

SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" IS NULL  ORDER BY "cuisines"."id" ASC LIMIT 1
---
  def details
    respond_to do |format|
      format.js{
        offset = params[:offset]
        if offset
          offset = offset.to_i
        else
          offset = 0
        end

        cuis = Cuisine.where(id: params[:cuisine].to_i).first

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ?  ORDER BY "restaurants"."id" ASC LIMIT 1  [["id", 1]]
---
  def ankiting
    @count = params[:which]
    @id = params[:id]
    respond_to do |format|
      format.html { render :template => '/restaurants/details', :locals => { :which => @count, :@restaurant => Restaurant.where(id: @id.to_i).first } }

INSERT INTO "restaurants" ("name", "phone_no", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "abcd"], ["phone_no", ""], ["address", ""], ["created_at", "2017-07-29 14:52:47.138319"], ["updated_at", "2017-07-29 14:52:47.138319"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ?  ORDER BY "restaurants"."id" ASC LIMIT 1  [["id", 0]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])